In [1]:
import numpy as np

In [2]:
import pandas as pd

In [5]:
df = pd.DataFrame({'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]})
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [6]:
nba = pd.read_csv('nba.csv')

In [7]:
nba.shape

(458, 9)

In [8]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [9]:
nba.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [10]:
nba.ndim

2

In [11]:
nba = pd.read_csv('nba.csv', index_col='Name')
nba.head()

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [13]:
nba.columns

Index(['Team', 'Number', 'Position', 'Age', 'Height', 'Weight', 'College',
       'Salary'],
      dtype='object')

In [15]:
nba.index

Index([ 'Avery Bradley',    'Jae Crowder',   'John Holland',    'R.J. Hunter',
        'Jonas Jerebko',   'Amir Johnson',  'Jordan Mickey',   'Kelly Olynyk',
         'Terry Rozier',   'Marcus Smart',
       ...
       'Gordon Hayward',    'Rodney Hood',     'Joe Ingles',  'Chris Johnson',
           'Trey Lyles',   'Shelvin Mack',      'Raul Neto',   'Tibor Pleiss',
          'Jeff Withey',              nan],
      dtype='object', name='Name', length=458)

In [16]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
Index: 458 entries, Avery Bradley to nan
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Team      457 non-null    object
 1   Number    457 non-null    float64
 2   Position  457 non-null    object
 3   Age       457 non-null    float64
 4   Height    457 non-null    object
 5   Weight    457 non-null    float64
 6   College   373 non-null    object
 7   Salary    446 non-null    float64
dtypes: float64(4), object(4)
memory usage: 32.2+ KB

In [17]:
nba['Age'].head()

Name
Avery Bradley    25.0
Jae Crowder      25.0
John Holland     27.0
R.J. Hunter      22.0
Jonas Jerebko    29.0
Name: Age, dtype: float64

In [18]:
nba[['Age', 'Height', 'Weight']].head()

                Age Height  Weight
Name
Avery Bradley  25.0    6-2   180.0
Jae Crowder    25.0    6-6   235.0
John Holland   27.0    6-5   205.0
R.J. Hunter    22.0    6-5   185.0
Jonas Jerebko  29.0   6-10   231.0

In [21]:
nba.loc[['Avery Bradley']]

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0

In [23]:
nba.loc[['Avery Bradley', 'John Holland'], ['Team', 'Position']]

                         Team Position
Name
Avery Bradley  Boston Celtics       PG
John Holland   Boston Celtics       SG

In [24]:
nba.iloc[0:3, 0:3]

                         Team  Number Position
Name
Avery Bradley  Boston Celtics     0.0       PG
Jae Crowder    Boston Celtics    99.0       SF
John Holland   Boston Celtics    30.0       SG

In [27]:
 nba[nba['Age']  == nba['Age'].max()]

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Tim Duncan,San Antonio Spurs,21.0,C,40.0,6-11,250.0,Wake Forest,5250000.0
Andre Miller,San Antonio Spurs,24.0,PG,40.0,6-3,200.0,Utah,250750.0
Kevin Garnett,Minnesota Timberwolves,21.0,PF,40.0,6-11,240.0,NaN,8500000.0

In [34]:
cond1 = nba['Position'] == 'C'
cond2 = nba['Age'] >=35
nba.loc[ cond1 & cond2 ]

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Pau Gasol,Chicago Bulls,16.0,C,35.0,7-0,250.0,NaN,7448760.0
Matt Bonner,San Antonio Spurs,15.0,C,36.0,6-10,235.0,Florida,947276.0
Tim Duncan,San Antonio Spurs,21.0,C,40.0,6-11,250.0,Wake Forest,5250000.0
Nazr Mohammed,Oklahoma City Thunder,13.0,C,38.0,6-10,250.0,Kentucky,222888.0

In [35]:
cond1 = nba['College'].isin(['Florida', 'Kentucky'])
cond2 = nba['Weight'] > 250
nba.loc[cond1 & cond2]

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Marreese Speights,Golden State Warriors,5.0,C,28.0,6-10,255.0,Florida,3815000.0
DeMarcus Cousins,Sacramento Kings,15.0,C,25.0,6-11,270.0,Kentucky,15851950.0
Terrence Jones,Houston Rockets,6.0,PF,24.0,6-9,252.0,Kentucky,2489530.0
Anthony Davis,New Orleans Pelicans,23.0,PF,23.0,6-10,253.0,Kentucky,7070730.0

In [37]:
cond = nba['Age'] >=35
nba.loc[cond, 'Salary'].mean()

3826836.9

In [39]:
nba.query("Age > 35 and Position=='C'")

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Matt Bonner,San Antonio Spurs,15.0,C,36.0,6-10,235.0,Florida,947276.0
Tim Duncan,San Antonio Spurs,21.0,C,40.0,6-11,250.0,Wake Forest,5250000.0
Nazr Mohammed,Oklahoma City Thunder,13.0,C,38.0,6-10,250.0,Kentucky,222888.0

In [40]:
g = nba.groupby('Team')

In [44]:
for t, df in g:
    print(t, ':', df['Salary'].mean())

Atlanta Hawks : 4860196.666666667
Boston Celtics : 4181504.8571428573
Brooklyn Nets : 3501898.3333333335
Charlotte Hornets : 5222728.0
Chicago Bulls : 5785558.533333333
Cleveland Cavaliers : 7642049.214285715
Dallas Mavericks : 4746582.133333334
Denver Nuggets : 4294423.571428572
Detroit Pistons : 4477884.2
Golden State Warriors : 5924599.8
Houston Rockets : 5018868.066666666
Indiana Pacers : 4450121.733333333
Los Angeles Clippers : 6323642.666666667
Los Angeles Lakers : 4784695.4
Memphis Grizzlies : 5467920.0
Miami Heat : 6347359.461538462
Milwaukee Bucks : 4350219.8125
Minnesota Timberwolves : 4593053.615384615
New Orleans Pelicans : 4355303.894736842
New York Knicks : 4581493.625
Oklahoma City Thunder : 6251019.866666666
Orlando Magic : 4297247.857142857
Philadelphia 76ers : 2213778.1428571427
Phoenix Suns : 4229675.666666667
Portland Trail Blazers : 3220121.2
Sacramento Kings : 4778911.066666666
San Antonio Spurs : 5629515.533333333
Toronto Raptors : 4741174.066666666
Utah Jazz : 4204006.066666666
Washington Wizards : 5088575.733333333

In [45]:
nba.groupby(['Team'])['Salary'].mean()

Team
Atlanta Hawks             4.860197e+06
Boston Celtics            4.181505e+06
Brooklyn Nets             3.501898e+06
Charlotte Hornets         5.222728e+06
Chicago Bulls             5.785559e+06
Cleveland Cavaliers       7.642049e+06
Dallas Mavericks          4.746582e+06
Denver Nuggets            4.294424e+06
Detroit Pistons           4.477884e+06
Golden State Warriors     5.924600e+06
Houston Rockets           5.018868e+06
Indiana Pacers            4.450122e+06
Los Angeles Clippers      6.323643e+06
Los Angeles Lakers        4.784695e+06
Memphis Grizzlies         5.467920e+06
Miami Heat                6.347359e+06
Milwaukee Bucks           4.350220e+06
Minnesota Timberwolves    4.593054e+06
New Orleans Pelicans      4.355304e+06
New York Knicks           4.581494e+06
Oklahoma City Thunder     6.251020e+06
Orlando Magic             4.297248e+06
Philadelphia 76ers        2.213778e+06
Phoenix Suns              4.229676e+06
Portland Trail Blazers    3.220121e+06
Sacramento Kings          4.778911e+06
San Antonio Spurs         5.629516e+06
Toronto Raptors           4.741174e+06
Utah Jazz                 4.204006e+06
Washington Wizards        5.088576e+06
Name: Salary, dtype: float64

In [46]:
nba.groupby(['Position'])['Salary'].mean()

Position
C     5.967052e+06
PF    4.562483e+06
PG    5.077829e+06
SF    4.857393e+06
SG    4.009861e+06
Name: Salary, dtype: float64

In [47]:
# Use 3 decimal places in output display
pd.set_option('display.precision', 3)

# Don't wrap repr(DataFrame) across additional lines
pd.set_option('display.expand_frame_repr', False)

# Set max rows displayed in output to 25
pd.set_option('display.max_rows', 25)

<h3> Explore U.S. Congress Dataset </h3>

In [54]:
dtypes = {
    'first_name' : 'category',
    'gender' : 'category',
    'type' : 'category',
    'state' : 'category',
    'party': 'category'
}

df = pd.read_csv(r'./groupby-data/legislators-historical.csv', 
                 dtype=dtypes, 
                 usecols=list(dtypes) + ['birthday','last_name'],
                parse_dates=['birthday'])

In [55]:
df.dtypes

last_name             object
first_name          category
birthday      datetime64[ns]
gender              category
type                category
state               category
party               category
dtype: object

In [58]:
df.columns

Index(['last_name', 'first_name', 'birthday', 'gender', 'type', 'state',
       'party'],
      dtype='object')

In [59]:
df.index

RangeIndex(start=0, stop=11975, step=1)

In [60]:
df.head(5)

  last_name  first_name   birthday gender type state                party
0   Bassett     Richard 1745-04-02      M  sen    DE  Anti-Administration
1     Bland  Theodorick 1742-03-21      M  rep    VA                  NaN
2     Burke     Aedanus 1743-06-16      M  rep    SC                  NaN
3   Carroll      Daniel 1730-07-22      M  rep    MD                  NaN
4    Clymer      George 1739-03-16      M  rep    PA                  NaN

In [61]:
df.tail(5)

      last_name first_name   birthday gender type state       party
11970   Garrett     Thomas 1972-03-27      M  rep    VA  Republican
11971    Handel      Karen 1962-04-18      F  rep    GA  Republican
11972     Jones     Brenda 1959-10-24      F  rep    MI    Democrat
11973    Marino        Tom 1952-08-15      M  rep    PA  Republican
11974     Jones     Walter 1943-02-10      M  rep    NC  Republican

In [64]:
# What is the count of Congressional members, on a state-by-state basis, over the entire history of the dataset?
df.groupby(['state'])['last_name'].count()

state
AK     16
AL    206
AR    117
AS      2
AZ     48
     ...
VT    115
WA     95
WI    196
WV    120
WY     40
Name: last_name, Length: 58, dtype: int64

In [73]:
# count for each state
for _state, _df in df.groupby(['state']):
    print(_state, _df.shape[0])

AK 16
AL 206
AR 117
AS 2
AZ 48
CA 361
CO 90
CT 240
DC 2
DE 97
DK 9
FL 155
GA 309
GU 4
HI 23
IA 202
ID 59
IL 486
IN 341
KS 141
KY 373
LA 197
MA 426
MD 305
ME 175
MI 294
MN 160
MO 333
MS 155
MT 52
NC 354
ND 44
NE 127
NH 181
NJ 359
NM 54
NV 56
NY 1461
OH 674
OK 92
OL 2
OR 89
PA 1053
PI 13
PR 19
RI 107
SC 251
SD 51
TN 299
TX 256
UT 53
VA 432
VI 4
VT 115
WA 95
WI 196
WV 120
WY 40

In [74]:
df.groupby(['state', 'gender'])['last_name'].count()

state  gender
AK     F           0
       M          16
AL     F           3
       M         203
AR     F           5
                ...
WI     M         196
WV     F           1
       M         119
WY     F           2
       M          38
Name: last_name, Length: 116, dtype: int64

In [82]:
# In the Pandas version, the grouped-on columns are pushed into the MultiIndex of the resulting Series by default
n_by_state_gender = df.groupby(['state', 'gender'])['last_name'].count();

In [85]:
type(n_by_state_gender)

pandas.core.series.Series

In [86]:
n_by_state_gender.index[:5]

MultiIndex([('AK', 'F'),
            ('AK', 'M'),
            ('AL', 'F'),
            ('AL', 'M'),
            ('AR', 'F')],
           names=['state', 'gender'])

In [89]:
# To more closely emulate the SQL result and push the grouped-on columns back into columns in the result, you an use as_index=False:
df.groupby(['state', 'gender'], as_index=False)['last_name'].count()

    state gender  last_name
0      AK      F        NaN
1      AK      M       16.0
2      AL      F        3.0
3      AL      M      203.0
4      AR      F        5.0
..    ...    ...        ...
111    WI      M      196.0
112    WV      F        1.0
113    WV      M      119.0
114    WY      F        2.0
115    WY      M       38.0

[116 rows x 3 columns]

In [95]:
df.groupby(['state', 'gender'])['last_name'].size()

state  gender
AK     F           0
       M          16
AL     F           3
       M         203
AR     F           5
                ...
WI     M         196
WV     F           1
       M         119
WY     F           2
       M          38
Name: last_name, Length: 116, dtype: int64

<h3> How Pandas GroupBy Works </h3>

In [97]:
by_state = df.groupby('state')

In [98]:
print(by_state)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000024D09CD3518>

<p>One term that’s frequently used alongside .groupby() is split-apply-combine. This refers to a chain of three steps:</p>

<ul>
<li>Split a table into groups</li>
<li>Apply some operations to each of those smaller tables</li>
<li>Combine the results</li>
</ul>

In [102]:
for _state, _frame in by_state:
    print(_state, _frame.shape[0])

AK 16
AL 206
AR 117
AS 2
AZ 48
CA 361
CO 90
CT 240
DC 2
DE 97
DK 9
FL 155
GA 309
GU 4
HI 23
IA 202
ID 59
IL 486
IN 341
KS 141
KY 373
LA 197
MA 426
MD 305
ME 175
MI 294
MN 160
MO 333
MS 155
MT 52
NC 354
ND 44
NE 127
NH 181
NJ 359
NM 54
NV 56
NY 1461
OH 674
OK 92
OL 2
OR 89
PA 1053
PI 13
PR 19
RI 107
SC 251
SD 51
TN 299
TX 256
UT 53
VA 432
VI 4
VT 115
WA 95
WI 196
WV 120
WY 40

In [103]:
by_state.get_group('OH')

      last_name first_name   birthday gender type state       party
226    McMillan    William 1764-03-02      M  rep    OH         NaN
254     Fearing       Paul 1762-02-28      M  rep    OH  Federalist
326       Smith       John        NaT      M  sen    OH  Republican
443      Tiffin     Edward 1766-06-19      M  sen    OH  Republican
453       Meigs     Return 1764-11-17      M  sen    OH  Republican
...         ...        ...        ...    ...  ...   ...         ...
11707   Schmidt       Jean 1951-11-29      F  rep    OH  Republican
11712    Sutton      Betty 1963-07-31      F  rep    OH    Democrat
11799   Boehner       John 1949-11-17      M  rep    OH  Republican
11871    Tiberi    Patrick 1962-10-21      M  rep    OH  Republican
11922   Renacci      James 1958-12-03      M  rep    OH  Republican

[674 rows x 7 columns]

In [104]:
by_state.groups['OH']

Int64Index([  226,   254,   326,   443,   453,   462,   475,   523,   589,
              671,
            ...
            11605, 11616, 11653, 11686, 11687, 11707, 11712, 11799, 11871,
            11922],
           dtype='int64', length=674)

In [108]:
by_state.groups

{'AK': Int64Index([ 6619,  6647,  7442,  7501,  8039,  8236,  8877,  9819,  9951,
              9985, 10082, 10108, 10325, 11262, 11386, 11734],
            dtype='int64'),
 'AL': Int64Index([  912,   991,  1079,  1180,  1252,  1307,  1320,  1360,  1533,
              1621,
             ...
             11321, 11463, 11473, 11536, 11545, 11557, 11725, 11745, 11861,
             11870],
            dtype='int64', length=206),
 'AR': Int64Index([ 1001,  1279,  2096,  2254,  2318,  2421,  2466,  2472,  2598,
              3103,
             ...
             11156, 11188, 11239, 11307, 11429, 11531, 11602, 11704, 11741,
             11758],
            dtype='int64', length=117),
 'AS': Int64Index([10797, 11755], dtype='int64'),
 'AZ': Int64Index([ 3674,  3725,  3801,  4657,  4700,  5044,  5110,  5986,  6505,
              7244,  7541,  8103,  8386,  8431,  9132,  9163,  9355,  9441,
              9775,  9821,  9959, 10132, 10315, 10374, 10603, 10636, 10682,
             10744, 10817, 10966, 10987, 11010, 11017, 11335, 11418, 11427,
             11512, 11583, 11600, 11626, 11699, 11773, 11784, 11849, 11868,
             11878, 11881, 11900],
            dtype='int64'),
 'CA': Int64Index([ 2650,  2742,  2747,  2830,  2832,  2901,  3078,  3096,  3184,
              3221,
             ...
             11830, 11846, 11860, 11896, 11909, 11923, 11929, 11938, 11949,
             11950],
            dtype='int64', length=361),
 'CO': Int64Index([ 3614,  3933,  4546,  4737,  4950,  4955,  4957,  5081,  5336,
              5665,  5827,  6033,  6281,  6360,  6494,  6521,  6560,  6634,
              6652,  6674,  6677,  6798,  6975,  7069,  7121,  7122,  7255,
              7322,  7330,  7623,  7769,  7808,  7915,  7919,  7922,  8091,
              8107,  8135,  8226,  8249,  8250,  8627,  8638,  8647,  8685,
              8842,  8907,  8991,  9188,  9245,  9259,  9352,  9540,  9567,
              9659,  9802,  9941,  9982, 10051, 10087, 10105, 10160, 10199,
             10239, 10413, 10511, 10608, 10676, 10708, 10732, 10748, 10802,
             10878, 11152, 11207, 11209, 11230, 11329, 11344, 11377, 11392,
             11419, 11442, 11504, 11517, 11575, 11597, 11743, 11893, 11920],
            dtype='int64'),
 'CT': Int64Index([   14,    16,    35,    45,    49,    77,    83,    94,   138,
               140,
             ...
             11115, 11191, 11247, 11313, 11406, 11424, 11446, 11516, 11643,
             11939],
            dtype='int64', length=240),
 'DC': Int64Index([4232, 10821], dtype='int64'),
 'DE': Int64Index([    0,    40,    93,   129,   165,   189,   333,   401,   527,
               664,   706,   730,   930,  1081,  1153,  1253,  1308,  1324,
              1403,  1634,  1861,  2008,  2049,  2076,  2311,  2581,  2666,
              2735,  2927,  3073,  3170,  3176,  3466,  3527,  3680,  3686,
              3702,  3769,  3802,  3869,  4078,  4293,  4677,  4807,  4880,
              5068,  5175,  5429,  5475,  5722,  5765,  6030,  6084,  6102,
              6223,  6224,  6401,  6449,  6645,  6717,  6924,  6998,  7018,
              7120,  7218,  7352,  7383,  7400,  7605,  7672,  7678,  7837,
              8137,  8146,  8252,  8476,  8479,  8497,  8556,  8719,  8847,
              8861,  8956,  9069,  9457,  9494,  9563,  9939,  9978,  9986,
             10387, 10596, 11151, 11532, 11542, 11618, 11816],
            dtype='int64'),
 'DK': Int64Index([3642, 3687, 3809, 4033, 4215, 4618, 4693, 5059, 5451], dtype='int64'),
 'FL': Int64Index([ 1031,  1090,  1781,  1948,  2351,  2459,  2693,  2772,  3115,
              3168,
             ...
             11851, 11852, 11853, 11856, 11879, 11886, 11925, 11926, 11928,
             11951],
            dtype='int64', length=155),
 'GA': Int64Index([    8,    20,    51,    54,    63,   101,   114,   147,   219,
               262,
             ...
             11574, 11576, 11735, 11746, 11749, 11757, 11762, 11848, 11862,
             11971],
            dtype='int64', length=309),
 'GU': Int64Index([10704, 10874, 11338, 11890], dtype='int64'),
 'HI': Int64Index([ 6395,  7524,  7591,  7791,  8147,  8333,  8789,  9412,  9490,
              9632,  9664,  9815, 10133, 10725, 10836, 10848, 11317, 11525,
             11622, 11637, 11638, 11802, 11963],
            dtype='int64'),
 'IA': Int64Index([ 1931,  2391,  2599,  2678,  2688,  2726,  2779,  2928,  2961,
              2973,
             ...
             11132, 11298, 11428, 11434, 11664, 11737, 11748, 11763, 11952,
             11953],
            dtype='int64', length=202),
 'ID': Int64Index([ 3693,  3846,  4027,  4155,  4406,  4587,  4801,  5072,  5151,
              5535,  5854,  6009,  6082,  6087,  6272,  6306,  6317,  6790,
              6792,  7002,  7168,  7214,  7393,  7874,  8119,  8210,  8286,
              8353,  8507,  8643,  8946,  8992,  9063,  9127,  9266,  9278,
              9290,  9384,  9388,  9631,  9716,  9755,  9820,  9977, 10003,
             10237, 10313, 10670, 10737, 10800, 10983, 11038, 11043, 11233,
             11354, 11436, 11514, 11582, 11912],
            dtype='int64'),
 'IL': Int64Index([  595,   772,   861,   890,  1146,  1182,  1414,  1451,  1518,
              1593,
             ...
             11692, 11706, 11714, 11789, 11798, 11808, 11854, 11905, 11908,
             11927],
            dtype='int64', length=486),
 'IN': Int64Index([  431,   985,  1089,  1130,  1269,  1316,  1402,  1441,  1501,
              1502,
             ...
             11562, 11604, 11644, 11666, 11697, 11807, 11847, 11897, 11924,
             11940],
            dtype='int64', length=341),
 'KS': Int64Index([ 3163,  3422,  3506,  3697,  3750,  3795,  3882,  3944,  4090,
              4238,
             ...
             11213, 11399, 11440, 11458, 11585, 11612, 11831, 11859, 11910,
             11936],
            dtype='int64', length=141),
 'KY': Int64Index([   55,   113,   123,   126,   196,   248,   251,   342,   356,
               376,
             ...
             11163, 11170, 11361, 11373, 11400, 11433, 11497, 11625, 11669,
             11801],
            dtype='int64', length=373),
 'LA': Int64Index([  584,   585,   586,   620,   814,   864,   901,   906,  1166,
              1270,
             ...
             11524, 11540, 11581, 11688, 11726, 11739, 11792, 11811, 11813,
             11823],
            dtype='int64', length=197),
 'MA': Int64Index([    6,    12,    22,    33,    36,    60,    65,    66,    75,
                89,
             ...
             11548, 11621, 11648, 11676, 11695, 11722, 11724, 11781, 11892,
             11934],
            dtype='int64', length=426),
 'MD': Int64Index([    3,     5,    10,    24,    25,    34,    39,    43,    44,
                48,
             ...
             11296, 11319, 11326, 11478, 11523, 11573, 11655, 11809, 11818,
             11941],
            dtype='int64', length=305),
 'ME': Int64Index([ 1019,  1029,  1032,  1073,  1074,  1091,  1094,  1119,  1202,
              1211,
             ...
             10808, 10838, 10883, 10997, 11133, 11275, 11456, 11646, 11768,
             11954],
            dtype='int64', length=175),
 'MI': Int64Index([ 1062,  1133,  1364,  1561,  1869,  1937,  2033,  2212,  2293,
              2360,
             ...
             11754, 11776, 11790, 11804, 11812, 11867, 11914, 11955, 11956,
             11972],
            dtype='int64', length=294),
 'MN': Int64Index([ 2866,  3241,  3267,  3308,  3478,  3760,  3823,  4017,  4057,
              4058,
             ...
             11589, 11672, 11744, 11834, 11869, 11899, 11917, 11935, 11942,
             11965],
            dtype='int64', length=160),
 'MO': Int64Index([  627,   712,  1174,  1236,  1266,  1419,  1470,  1577,  1665,
              1849,
             ...
             11342, 11363, 11376, 11396, 11485, 11601, 11651, 11668, 11721,
             11885],
            dtype='int64', length=333),
 'MS': Int64Index([  256,   260,   743,   842,   994,  1163,  1232,  1283,  1291,
              1397,
             ...
             11139, 11200, 11330, 11498, 11507, 11543, 11610, 11797, 11873,
             11906],
            dtype='int64', length=155),
 'MT': Int64Index([ 3756,  3941,  4094,  5033,  5342,  5536,  5537,  5581,  5968,
              6086,  6188,  6295,  6308,  6316,  6529,  6662,  6967,  7252,
              7344,  7615,  7642,  8113,  8167,  8231,  8298,  8387,  8458,
              8587,  8713,  8820,  8850,  9026,  9113,  9410,  9493,  9511,
              9618, 10037, 10080, 10156, 10261, 10282, 10473, 10683, 10939,
             11164, 11250, 11284, 11700, 11731, 11793, 11864],
            dtype='int64'),
 'NC': Int64Index([   13,    17,    30,    47,    53,    67,    79,    80,    81,
                98,
             ...
             11693, 11694, 11708, 11729, 11736, 11766, 11795, 11819, 11943,
             11974],
            dtype='int64', length=354),
 'ND': Int64Index([ 5384,  5479,  5835,  6446,  6491,  6701,  6802,  6863,  6875,
              6921,  7189,  7318,  7340,  7346,  7399,  7603,  7767,  8072,
              8134,  8363,  8428,  8693,  9022,  9186,  9251,  9297,  9430,
              9534,  9578,  9630,  9854,  9868,  9950, 10065, 10153, 10386,
             10555, 10810, 10995, 11407, 11593, 11640, 11657, 11944],
            dtype='int64'),
 'NE': Int64Index([ 2954,  3068,  3209,  3362,  3627,  3860,  3895,  4048,  4136,
              4193,
             ...
             11130, 11173, 11225, 11348, 11366, 11435, 11645, 11780, 11796,
             11857],
            dtype='int64', length=127),
 'NH': Int64Index([   99,   120,   134,   180,   184,   209,   214,   223,   255,
               273,
             ...
             11166, 11210, 11387, 11398, 11414, 11563, 11656, 11805, 11855,
             11964],
            dtype='int64', length=181),
 'NJ': Int64Index([    7,    23,    28,    58,    59,    62,    64,    71,   118,
               135,
             ...
             11723, 11728, 11732, 11761, 11777, 11825, 11901, 11913, 11915,
             11957],
            dtype='int64', length=359),
 'NM': Int64Index([ 2885,  3420,  3595,  3672,  3814,  3942,  4118,  4649,  4763,
              5030,  5035,  5790,  6246,  6483,  6882,  6900,  6999,  7040,
              7380,  7429,  7447,  7540,  7621,  7709,  7895,  7928,  7946,
              8027,  8070,  8899,  9155,  9265,  9491,  9551,  9638,  9782,
              9983, 10012, 10026, 10057, 10164, 10454, 10533, 10785, 11203,
             11204, 11208, 11333, 11358, 11522, 11611, 11639, 11882, 11918],
            dtype='int64'),
 'NV': Int64Index([ 3510,  3664,  3698,  3797,  3872,  3966,  4285,  4506,  4681,
              4712,  4837,  4969,  5353,  5544,  6099,  6261,  6614,  6738,
              6960,  7001,  7225,  7357,  7390,  7428,  7743,  7898,  8060,
              8466,  8855,  8945,  8971,  8975,  9190,  9346,  9434,  9467,
              9524, 10040, 10106, 10290, 10402, 10616, 10640, 10672, 11004,
             11097, 11160, 11412, 11472, 11508, 11658, 11810, 11828, 11858,
             11937, 11966],
            dtype='int64'),
 'NY': Int64Index([    9,    26,    32,    42,    46,    73,    90,    91,    92,
                97,
             ...
             11794, 11826, 11827, 11833, 11843, 11872, 11894, 11962, 11967,
             11968],
            dtype='int64', length=1461),
 'OH': Int64Index([  226,   254,   326,   443,   453,   462,   475,   523,   589,
               671,
             ...
             11605, 11616, 11653, 11686, 11687, 11707, 11712, 11799, 11871,
             11922],
            dtype='int64', length=674),
 'OK': Int64Index([ 5601,  6060,  6314,  6669,  6759,  7094,  7146,  7182,  7224,
              7431,  7471,  7477,  7502,  7504,  7544,  7566,  7572,  7575,
              7635,  7643,  7775,  7803,  7809,  7879,  8012,  8037,  8121,
              8127,  8311,  8330,  8334,  8338,  8370,  8429,  8554,  8567,
              8608,  8658,  8742,  8799,  8822,  8878,  8919,  8923,  8967,
              9006,  9058,  9066,  9141,  9177,  9185,  9233,  9292,  9368,
              9373,  9670,  9731,  9808,  9850,  9885,  9924,  9997, 10022,
             10109, 10130, 10193, 10201, 10260, 10304, 10309, 10342, 10447,
             10540, 10730, 10875, 10898, 11016, 11057, 11082, 11095, 11263,
             11311, 11339, 11340, 11350, 11422, 11555, 11663, 11711, 11753,
             11876, 11958],
            dtype='int64'),
 'OL': Int64Index([404, 503], dtype='int64'),
 'OR': Int64Index([ 2728,  3398,  3442,  3453,  3474,  3577,  3581,  3583,  3603,
              3658,  3734,  3787,  3817,  3858,  4030,  4139,  4315,  4390,
              4465,  4467,  4599,  4679,  4780,  4794,  4999,  5409,  5969,
              6170,  6347,  6349,  6439,  6498,  6548,  6557,  6623,  6635,
              6769,  7076,  7077,  7175,  7392,  7614,  7656,  7760,  7861,
              7907,  7992,  8073,  8139,  8331,  8365,  8425,  8555,  8622,
              8625,  8673,  8817,  8913,  9023,  9223,  9374,  9393,  9481,
              9489,  9514,  9673,  9691,  9692,  9715,  9851,  9853, 10213,
             10226, 10296, 10494, 10546, 10750, 10853, 10870, 10912, 11040,
             11064, 11099, 11107, 11181, 11212, 11383, 11484, 11633],
            dtype='int64'),
 'PA': Int64Index([    4,    19,    21,    27,    38,    57,    69,    76,    84,
                88,
             ...
             11842, 11866, 11875, 11877, 11887, 11891, 11932, 11945, 11959,
             11973],
            dtype='int64', length=1053),
 'PI': Int64Index([6835, 6939, 7185, 7233, 7516, 7555, 7961, 8349, 8414, 8434, 8593,
             8881, 9046],
            dtype='int64'),
 'PR': Int64Index([ 6426,  6811,  7235,  8106,  8195,  8675,  8927,  9034,  9810,
             10016, 10126, 10310, 10660, 10885, 10903, 11206, 11343, 11476,
             11841],
            dtype='int64'),
 'RI': Int64Index([   61,   105,   161,   195,   215,   252,   284,   322,   336,
               355,
             ...
             10289, 10482, 10795, 10850, 10960, 11050, 11100, 11270, 11287,
             11568],
            dtype='int64', length=107),
 'SC': Int64Index([    2,    15,    31,    37,    50,    72,    87,   111,   131,
               145,
             ...
             11251, 11334, 11529, 11537, 11565, 11606, 11720, 11863, 11903,
             11947],
            dtype='int64', length=251),
 'SD': Int64Index([ 5423,  5462,  5591,  5609,  5798,  5993,  5995,  6101,  6104,
              6106,  6454,  6671,  6679,  6710,  6758,  7021,  7089,  7200,
              7293,  7435,  7500,  7801,  8082,  8154,  8238,  8346,  8485,
              8491,  8511,  8553,  8624,  8863,  8993,  9207,  9508,  9541,
              9781, 10014, 10039, 10084, 10190, 10214, 10354, 10554, 10638,
             10962, 11238, 11369, 11561, 11738, 11916],
            dtype='int64'),
 'TN': Int64Index([  141,   142,   198,   350,   378,   457,   496,   517,   518,
               596,
             ...
             11423, 11465, 11546, 11556, 11608, 11613, 11821, 11883, 11889,
             11898],
            dtype='int64', length=299),
 'TX': Int64Index([ 2568,  2671,  2814,  2857,  2864,  2966,  3016,  3058,  3084,
              3186,
             ...
             11874, 11888, 11895, 11904, 11907, 11911, 11919, 11931, 11933,
             11946],
            dtype='int64', length=256),
 'UT': Int64Index([ 3484,  3647,  4137,  4816,  5564,  5882,  6039,  6040,  6135,
              6333,  6982,  7065,  7196,  7463,  7510,  7908,  7996,  8087,
              8172,  8448,  8809,  9041,  9065,  9304,  9328,  9453,  9458,
              9549,  9641,  9754,  9928, 10038, 10041, 10154, 10167, 10338,
             10519, 10679, 10740, 10775, 10841, 10957, 11076, 11143, 11161,
             11235, 11303, 11393, 11460, 11764, 11865, 11884, 11960],
            dtype='int64'),
 'VA': Int64Index([    1,    11,    18,    29,    52,    74,    78,    85,    95,
               100,
             ...
             11771, 11783, 11824, 11832, 11845, 11902, 11948, 11961, 11969,
             11970],
            dtype='int64', length=432),
 'VI': Int64Index([10496, 11088, 11116, 11752], dtype='int64'),
 'VT': Int64Index([   41,    86,   106,   128,   156,   269,   325,   373,   400,
               411,
             ...
              8725,  9275,  9413,  9667,  9948, 10034, 10253, 10696, 10855,
             11308],
            dtype='int64', length=115),
 'WA': Int64Index([ 2979,  3052,  3450,  3623,  3720,  3832,  4119,  4303,  4613,
              4961,  5344,  5357,  5651,  5925,  5951,  6032,  6100,  6155,
              6210,  6403,  6590,  6761,  6822,  6990,  7020,  7039,  7198,
              7335,  7351,  7761,  7881,  7949,  8005,  8130,  8145,  8152,
              8219,  8247,  8439,  8450,  8473,  8488,  8637,  8722,  8776,
              8794,  8837,  8977,  8980,  9051,  9082,  9143,  9174,  9353,
              9569,  9665,  9739,  9828,  9874,  9876,  9883, 10072, 10170,
             10236, 10336, 10352, 10409, 10434, 10517, 10665, 10674, 10689,
             10757, 10762, 10784, 10882, 10947, 10949, 11022, 11041, 11081,
             11083, 11121, 11155, 11211, 11222, 11260, 11360, 11378, 11528,
             11628, 11674, 11760, 11836, 11921],
            dtype='int64'),
 'WI': Int64Index([ 2410,  2503,  2592,  2605,  2633,  2789,  2790,  2942,  2985,
              3081,
             ...
             11278, 11371, 11409, 11413, 11566, 11590, 11642, 11774, 11844,
             11930],
            dtype='int64', length=196),
 'WV': Int64Index([ 3615,  3690,  3751,  3785,  3786,  3849,  3854,  3881,  3930,
              3959,
             ...
             10629, 10645, 10982, 11271, 11459, 11584, 11623, 11742, 11775,
             11880],
            dtype='int64', length=120),
 'WY': Int64Index([ 4009,  4138,  4511,  4572,  4718,  5054,  5533,  5726,  6128,
              6895,  7620,  7831,  7925,  7988,  8038,  8052,  8280,  8545,
              8604,  8674,  8801,  8931,  9242,  9394,  9468,  9470,  9685,
              9722,  9783,  9998, 10098, 10159, 10235, 10449, 10811, 10860,
             10978, 11464, 11518, 11835],
            dtype='int64')}

In [112]:
_state, _frame = next(iter(by_state))
print(_state)
print(_frame.head())

AK
       last_name first_name   birthday gender type state        party
6619      Waskey      Frank 1875-04-20      M  rep    AK     Democrat
6647        Cale     Thomas 1848-09-17      M  rep    AK  Independent
7442     Grigsby     George 1874-12-02      M  rep    AK          NaN
7501      Sulzer    Charles 1879-02-24      M  rep    AK          NaN
8039  Sutherland     Daniel 1869-04-17      M  rep    AK   Republican

In [113]:
df.groupby('state')['last_name'].count()

state
AK     16
AL    206
AR    117
AS      2
AZ     48
     ...
VT    115
WA     95
WI    196
WV    120
WY     40
Name: last_name, Length: 58, dtype: int64

In [116]:
df.loc[df['state'] == 'AK', ['last_name']].shape[0]

16

<h3> Air Quality Dataset </h3

In [126]:
df = pd.read_csv(r'./groupby-data/airqual.csv', parse_dates=[['Date', 'Time']], na_values=[-200],
                usecols = ['Date', 'Time', "CO(GT)", "T", "RH", "AH"]).rename(columns={"CO(GT)":'co', 'Date_Time':'tstamp',"T": "temp_c",'RH':'rel_hum', 'AH':'abs_hum'}).set_index('tstamp')

In [127]:
df.head()

                      co  temp_c  rel_hum  abs_hum
tstamp
2004-03-10 18:00:00  2.6    13.6     48.9    0.758
2004-03-10 19:00:00  2.0    13.3     47.7    0.726
2004-03-10 20:00:00  2.2    11.9     54.0    0.750
2004-03-10 21:00:00  2.2    11.0     60.0    0.787
2004-03-10 22:00:00  1.6    11.2     59.6    0.789

<p>Here, co is that hour’s average carbon monoxide reading, while temp_c, rel_hum, and abs_hum are the average temperature in Celsius, relative humidity, and absolute humidity over that hour, respectively. The observations run from March 2004 through April 2005</p>

In [128]:
df.index.min()

Timestamp('2004-03-10 18:00:00')

In [129]:
df.index.max()

Timestamp('2005-04-04 14:00:00')

<h4>Grouping on Derived Arrays</h4>
<p>The first parameter to .groupby() can accept several different arguments:
<ul>
<li>A column or list of columns</li>
<li>A dict or Pandas Series</li>
<li>A NumPy array or Pandas Index, or an array-like iterable of these</li>

<p>We can take advantage of the last option in order to group by the day of the week. We can use the index’s .day_name() to produce a Pandas Index of strings. </p>

In [132]:
day_names = df.index.day_name()

In [134]:
print(type(day_names))
print(day_names[0:10])

<class 'pandas.core.indexes.base.Index'>
Index(['Wednesday', 'Wednesday', 'Wednesday', 'Wednesday', 'Wednesday',
       'Wednesday', 'Thursday', 'Thursday', 'Thursday', 'Thursday'],
      dtype='object', name='tstamp')

<b>Note: For a Pandas Series, rather than an Index, you’ll need the .dt accessor to get access to methods like .day_name(). If ser is your Series, then you’d need ser.dt.day_name().</b>

In [136]:
df.groupby(day_names)['co'].mean()

tstamp
Friday       2.543
Monday       2.017
Saturday     1.861
Sunday       1.438
Thursday     2.456
Tuesday      2.382
Wednesday    2.401
Name: co, dtype: float64

<p>The split-apply-combine process behaves largely the same as before, except that the splitting this time is done on an artificially-created column. This column doesn’t exist in the DataFrame itself, but rather is derived from it.</p>

In [139]:
hr_indx = df.index.hour
type(hr_indx)

pandas.core.indexes.numeric.Int64Index

In [140]:
df.groupby(hr_indx)['co'].mean()

tstamp
0     1.786
1     1.468
2     1.099
3     0.888
4     0.759
5     0.713
6     0.922
7     1.811
8     2.824
9     2.972
10    2.566
11    2.261
12    2.170
13    2.201
14    2.126
15    2.049
16    2.267
17    2.816
18    3.436
19    3.733
20    3.469
21    2.601
22    1.977
23    1.878
Name: co, dtype: float64

In [141]:
df.groupby([day_names, hr_indx])['co'].mean()

tstamp     tstamp
Friday     0         1.936
           1         1.609
           2         1.172
           3         0.887
           4         0.823
                     ...
Wednesday  19        4.147
           20        3.845
           21        2.898
           22        2.102
           23        1.938
Name: co, Length: 168, dtype: float64

In [142]:
df.groupby([day_names, hr_indx])['co'].mean().rename_axis(['dow','hr'])

dow        hr
Friday     0     1.936
           1     1.609
           2     1.172
           3     0.887
           4     0.823
                 ...
Wednesday  19    4.147
           20    3.845
           21    2.898
           22    2.102
           23    1.938
Name: co, Length: 168, dtype: float64

<p>Here’s one more similar case that uses .cut() to bin the temperature values into discrete intervals</p>

In [143]:
df['temp_c'].describe()

count    8991.000
mean       18.318
std         8.832
min        -1.900
25%        11.800
50%        17.800
75%        24.400
max        44.600
Name: temp_c, dtype: float64

In [149]:
temp_bins = pd.cut(df['temp_c'], bins=3, labels=('cool', 'warm', 'hot'))
print(type(temp_bins))
print(temp_bins[0:10])

<class 'pandas.core.series.Series'>
tstamp
2004-03-10 18:00:00    cool
2004-03-10 19:00:00    cool
2004-03-10 20:00:00    cool
2004-03-10 21:00:00    cool
2004-03-10 22:00:00    cool
2004-03-10 23:00:00    cool
2004-03-11 00:00:00    cool
2004-03-11 01:00:00    cool
2004-03-11 02:00:00    cool
2004-03-11 03:00:00    cool
Name: temp_c, dtype: category
Categories (3, object): [cool < warm < hot]

In [148]:
df[['rel_hum', 'abs_hum']].groupby(temp_bins).agg(['mean', 'median'])

       rel_hum        abs_hum
          mean median    mean median
temp_c
cool    57.651   59.2   0.666  0.658
warm    49.383   49.3   1.183  1.145
hot     24.994   24.1   1.293  1.274

<p><b>To group by an observation’s year and quarter</b></p>

In [151]:
df.groupby([df.index.year, df.index.quarter])['co'].agg(['max', 'min']).rename_axis(['year', 'quarter'])

               max  min
year quarter
2004 1         8.1  0.3
     2         7.3  0.1
     3         7.5  0.1
     4        11.9  0.1
2005 1         8.7  0.1
     2         5.0  0.3

<h4> Respampling </h4>
<p>This whole operation can, alternatively, be expressed through resampling. One of the uses of resampling is as a time-based groupby. All that you need to do is pass a frequency string, such as "Q" for "quarterly", and Pandas will do the rest</p>

In [153]:
df.resample('Q')['co'].agg(['max', 'min']).rename_axis('Quarter')

             max  min
Quarter
2004-03-31   8.1  0.3
2004-06-30   7.3  0.1
2004-09-30   7.5  0.1
2004-12-31  11.9  0.1
2005-03-31   8.7  0.1
2005-06-30   5.0  0.3

<h3>News Aggregator Dataset</h3>

In [154]:
import datetime as dt

In [155]:
def parse_millisecond_timestamp(ts: int) -> dt.datetime:
    '''Convert ms since unix epoch to UTC datetime instance.'''
    
    return dt.datetime.fromtimestamp(ts/1000, tz=dt.timezone.utc)

In [158]:
df = pd.read_csv(r"./groupby-data/news.csv",sep="\t", header=None, index_col=0, 
                names=['title', 'url', 'outlet', 'category', 'cluster', 'host', 'tstamp'],
                parse_dates=['tstamp'], 
                date_parser=parse_millisecond_timestamp,
                dtype={'outlet':'category', 'category':'category', 'cluster':'category', 'host':'category'})

In [159]:
df.head()

                                               title                                                url             outlet category                        cluster                 host                           tstamp
1  Fed official says weak data caused by weather,...  http://www.latimes.com/business/money/la-fi-mo...  Los Angeles Times        b  ddUyU0VZz0BRneMioxUPQVP6sIxvM      www.latimes.com 2014-03-10 16:52:50.698000+00:00
2  Fed's Charles Plosser sees high bar for change...  http://www.livemint.com/Politics/H2EvwJSK2VE6O...           Livemint        b  ddUyU0VZz0BRneMioxUPQVP6sIxvM     www.livemint.com 2014-03-10 16:52:51.207000+00:00
3  US open: Stocks fall after Fed official hints ...  http://www.ifamagazine.com/news/us-open-stocks...       IFA Magazine        b  ddUyU0VZz0BRneMioxUPQVP6sIxvM  www.ifamagazine.com 2014-03-10 16:52:51.550000+00:00
4  Fed risks falling 'behind the curve', Charles ...  http://www.ifamagazine.com/news/fed-risks-fall...       IFA Magazine        b  ddUyU0VZz0BRneMioxUPQVP6sIxvM  www.ifamagazine.com 2014-03-10 16:52:51.793000+00:00
5  Fed's Plosser: Nasty Weather Has Curbed Job Gr...  http://www.moneynews.com/Economy/federal-reser...          Moneynews        b  ddUyU0VZz0BRneMioxUPQVP6sIxvM    www.moneynews.com 2014-03-10 16:52:52.027000+00:00

<p><b>Using Lambda Functions in .groupby()</b></p>

<h4> which outlets talk most about the Federal Reserve  </h4>
<p>Let’s assume for simplicity that this entails searching for case-sensitive mentions of "Fed". Bear in mind that this may generate some false positives with terms like “Federal Government.”</p>

In [160]:
df.groupby('outlet', sort=False)['title'].apply(lambda s: s.str.contains('Fed').sum()).nlargest(10)

outlet
Reuters                         161
NASDAQ                          103
Businessweek                     93
Investing.com                    66
Wall Street Journal \(blog\)     61
MarketWatch                      56
Moneynews                        55
Bloomberg                        53
GlobalPost                       51
Economic Times                   44
Name: title, dtype: int64

In [162]:
# Alternate approach
is_Fed = df['title'].str.contains('Fed')
print(type(is_Fed))
print(is_Fed[0:5])

<class 'pandas.core.series.Series'>
1    True
2    True
3    True
4    True
5    True
Name: title, dtype: bool

In [163]:
is_Fed.groupby(df['outlet'], sort=False).sum().nlargest(10).astype(np.uintc)

outlet
Reuters                         161
NASDAQ                          103
Businessweek                     93
Investing.com                    66
Wall Street Journal \(blog\)     61
MarketWatch                      56
Moneynews                        55
Bloomberg                        53
GlobalPost                       51
Economic Times                   44
Name: title, dtype: uint32

<p>The two Series don’t need to be columns of the same DataFrame object. They just need to be of the same shape:</p>

In [164]:
is_Fed.shape

(422419,)

In [165]:
df['outlet'].shape

(422419,)